package day4;

import java.util.Scanner;

public class Thisisjava2 {

	public static void main(String[] args) {
		
		// 1차원 배열 문제,, 2차원인줄
//		Scanner scan = new Scanner(System.in);
//		String input; 
//		boolean flag = false;
//		
//		while(flag) {
//			System.out.println("------------------------------------------------------------------\r\n"
//									+ "1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료\r\n"
//									+ "----------------------------------------------------------------");
//			System.out.println("선택 > ");
//			input = scan.nextLine();
//			if(input.equals("1")) {
//				System.out.println("학생수 > ");
//				int num = scan.nextInt();
//				int[] scores = new int [num];
//			}else if(input.equals("2")) {
//				System.out.println("국어 >");
//				scores[0]=scan.nextInt();
//				System.out.println("수학 >");
//				System.out.println("영어 >");
//			}else if(input.equals("3")) {
//				
//			}else if(input.equals("4")) {
//				
//			}else {
//				flag = false;
//			}
//		
//		}
		
//		------------------------------------------------------
//		1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
//		------------------------------------------------------
//		선택> 1
//		학생수> 3
//		------------------------------------------------------
//		1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
//		------------------------------------------------------
//		선택> 2
//		scores[0]> 85
//		scores[1]> 95
//		scores[2]> 93
//		------------------------------------------------------
//		1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
//		------------------------------------------------------
//		선택> 3
//		scores[0]: 85
//		scores[1]: 95
//		scores[2]: 93
//		------------------------------------------------------
//		1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
//		------------------------------------------------------
//		선택> 4
//		최고 점수: 95
//		평균 점수: 91.0
//		------------------------------------------------------
//		1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
//		------------------------------------------------------
//		선택> 5
//		프로그램 종료
	}
}
